Revit 2027 API
RoofBase.FasciaDepth Property
Retrieve or set the FasciaDepth.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FasciaDepth { get; set; }
Public Property FasciaDepth As Double
	Get
	Set
public:
property double FasciaDepth {
	double get ();
	void set (double value);
}
member FasciaDepth : float with get, set
Property Value
Double
Remarks
If the EaveCutterType is PlumbCut, this property doesn't make sense.
See Also
Reference
RoofBase Class
Autodesk.Revit.DB Namespace